soap-jax-ws-server/wsdl/RegistrationServiceImplService.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.9-b130926.1035 svn-revision#5f6196f2b90e9460065a4c2f4e30e065b245e51e. -->
<definitions targetNamespace="http://service.server.ws.jax.soap.fedorizvekov.com/" name="RegistrationServiceImplService" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:tns="http://service.server.ws.jax.soap.fedorizvekov.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://service.server.ws.jax.soap.fedorizvekov.com/" schemaLocation="RegistrationServiceImplService_schema1.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://model.server.ws.jax.soap.fedorizvekov.com/" schemaLocation="RegistrationServiceImplService_schema2.xsd"/>
    </xsd:schema>
  </types>
  <message name="registration">
    <part name="parameters" element="tns:registration"/>
  </message>
  <message name="registrationResponse">
    <part name="parameters" element="tns:registrationResponse"/>
  </message>
  <portType name="RegistrationService">
    <operation name="registration">
      <input wsam:Action="http://service.server.ws.jax.soap.fedorizvekov.com/RegistrationService/registrationRequest" message="tns:registration"/>
      <output wsam:Action="http://service.server.ws.jax.soap.fedorizvekov.com/RegistrationService/registrationResponse" message="tns:registrationResponse"/>
    </operation>
  </portType>
  <binding name="RegistrationServiceImplPortBinding" type="tns:RegistrationService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="registration">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="RegistrationServiceImplService">
    <port name="RegistrationServiceImplPort" binding="tns:RegistrationServiceImplPortBinding">
      <soap:address location="REPLACE_WITH_ACTUAL_URL"/>
    </port>
  </service>
</definitions>

